Revit 2026 API

# BuiltInFailuresRebarBendingDetailFailures Class

---

Failures concerning rebar bending details.

SystemObject Autodesk.Revit.DBBuiltInFailuresRebarBendingDetailFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RebarBendingDetailFailures
```
```vb
Public NotInheritable Class RebarBendingDetailFailures
```
```cpp
public ref class RebarBendingDetailFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarBendingDetailFailures = class end
```

The BuiltInFailuresRebarBendingDetailFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RemoveBendingDetailWithInvalidRebarElement | The reinforcement element is no longer supporting bending details. The associated bending detail elements have been deleted. |

#### Reference

Autodesk.Revit.DB Namespace